ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/SPL/MDR32FxQI/inc/MDR32FxQI_eth.h
/**
  ******************************************************************************
  * @file    MDR32FxQI_eth.h
  * @author  Milandr Application Team
  * @version V2.0.0i
  * @date    10/03/2022
  * @brief   This file contains all the functions prototypes for the ETHERNET
  *          firmware library.
  ******************************************************************************
  * <br><br>
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, MILANDR SHALL NOT BE HELD LIABLE FOR ANY DIRECT, INDIRECT
  * OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2022 Milandr</center></h2>
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MDR32FxQI_ETH_H
#define __MDR32FxQI_ETH_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "MDR32FxQI_config.h"

/** @addtogroup __MDR32FxQI_StdPeriph_Driver MDR32FxQI Standard Peripherial Driver
  * @{
  */

#if defined (USE_MDR32F1QI)
/** @addtogroup ETHERNET
  * @{
  */

/** @defgroup ETH_Exported_Types ETHERNET Exported Types
  * @{
  */

/**
  * @brief ETHERNET PHY Mode
  */
typedef enum
{
    ETH_PHY_MODE_10BaseT_Half_Duplex                   = (uint32_t)(0x0 << ETH_PHY_CONTROL_MODE_Pos),
    ETH_PHY_MODE_10BaseT_Full_Duplex                   = (uint32_t)(0x1 << ETH_PHY_CONTROL_MODE_Pos),
    ETH_PHY_MODE_100BaseT_Half_Duplex                  = (uint32_t)(0x2 << ETH_PHY_CONTROL_MODE_Pos),
    ETH_PHY_MODE_100BaseT_Full_Duplex                  = (uint32_t)(0x3 << ETH_PHY_CONTROL_MODE_Pos),
    ETH_PHY_MODE_100BaseT_Half_Duplex_With_Auto_Tuning = (uint32_t)(0x4 << ETH_PHY_CONTROL_MODE_Pos),
    ETH_PHY_MODE_Repeater                              = (uint32_t)(0x5 << ETH_PHY_CONTROL_MODE_Pos),
    ETH_PHY_MODE_Low_Consumption                       = (uint32_t)(0x6 << ETH_PHY_CONTROL_MODE_Pos),
    ETH_PHY_MODE_AutoNegotiation                       = (uint32_t)(0x7 << ETH_PHY_CONTROL_MODE_Pos)
} ETH_PHY_MODE;

#define ETH_PHY_MODE_MASK            (uint32_t)(0x7 << ETH_PHY_CONTROL_MODE_Pos)

#define IS_ETH_PHY_MODE(MODE)        (((MODE) & (~ETH_PHY_MODE_MASK)) == 0)

/**
  * @brief ETHERNET PHY Interface
  */
typedef enum
{
    ETH_PHY_INTERFACE_FIBER_OPTIC    = (uint32_t)(0x01 << ETH_PHY_CONTROL_FX_EN_Pos),
    ETH_PHY_INTERFACE_ETHERNET_802_3 = (uint32_t)(0x00 << ETH_PHY_CONTROL_FX_EN_Pos)
} ETH_PHY_INTERFACE;

#define IS_ETH_PHY_INTERFACE(INTERFACE)  (((INTERFACE) == ETH_PHY_INTERFACE_FIBER_OPTIC) || \
                                          ((INTERFACE) == ETH_PHY_INTERFACE_ETHERNET_802_3))

/**
  * @brief ETHERNET DBG Mode
  */
typedef enum
{
    ETH_DBG_MODE_FREE_RUN = (uint32_t)(0x0 << ETH_G_CFGh_DBG_MODE_Pos),
    ETH_DBG_MODE_HALT     = (uint32_t)(0x2 << ETH_G_CFGh_DBG_MODE_Pos),
    ETH_DBG_MODE_STOP     = (uint32_t)(0x3 << ETH_G_CFGh_DBG_MODE_Pos)
} ETH_DBG_MODE;

#define IS_ETH_DBG_MODE(MODE)   ((MODE == ETH_DBG_MODE_FREE_RUN) | \
                                 (MODE == ETH_DBG_MODE_HALT)     | \
                                 (MODE == ETH_DBG_MODE_STOP))

/**
  * @brief ETHERNET Buffer Mode
  */
typedef enum
{
    ETH_BUFFER_MODE_LINEAR                    = (uint32_t) (0x0 << ETH_G_CFGl_BUFF_MODE_Pos),
    ETH_BUFFER_MODE_AUTOMATIC_CHANGE_POINTERS = (uint32_t) (0x1 << ETH_G_CFGl_BUFF_MODE_Pos),
    ETH_BUFFER_MODE_FIFO                      = (uint32_t) (0x2 << ETH_G_CFGl_BUFF_MODE_Pos)
} ETH_BUFFER_MODE;

#define IS_ETH_BUFFER_MODE(MODE)  ((MODE == ETH_BUFFER_MODE_LINEAR)                    | \
                                   (MODE == ETH_BUFFER_MODE_AUTOMATIC_CHANGE_POINTERS) | \
                                   (MODE == ETH_BUFFER_MODE_FIFO))

/**
  * @brief ETHERNET Transmitter bits order
  */
typedef enum
{
    ETH_TRANSMITTER_BITS_ORDER_LSB = (uint32_t)(0 << ETH_X_CFG_MSB1st_Pos),
    ETH_TRANSMITTER_BITS_ORDER_MSB = (uint32_t)(1 << ETH_X_CFG_MSB1st_Pos)
} ETH_TRANSMITTER_BITS_ORDER;

#define IS_ETH_TRANSMITTER_BITS_ORDER(ORDER)  ((ORDER == ETH_TRANSMITTER_BITS_ORDER_LSB ) || \
                                               (ORDER == ETH_TRANSMITTER_BITS_ORDER_MSB))

/**
  * @brief ETHERNET Transmitter Endain (little endian or big endian)
  */
typedef enum
{
    ETH_TRANSMITTER_BE_LITTLE_ENDIAN = (uint32_t)(0x0 << ETH_X_CFG_BE_Pos),
    ETH_TRANSMITTER_BE_BIG_ENDIAN    = (uint32_t)(0x1 << ETH_X_CFG_BE_Pos)
} ETH_TRANSMITTER_BE;

#define IS_ETH_TRANSMITTER_BE(BE)   ((BE == ETH_TRANSMITTER_BE_LITTLE_ENDIAN) | \
                                     (BE == ETH_TRANSMITTER_BE_BIG_ENDIAN))

/**
  * @brief ETHERNET Transmitter Event Mode
  */
typedef enum
{
    ETH_TRANSMITTER_EVENT_MODE_XFIFO_EMPTY        = (uint32_t)(0x0 << ETH_X_CFG_EVNT_MODE_Pos),
    ETH_TRANSMITTER_EVENT_MODE_XFIFO_ALMOST_EMPTY = (uint32_t)(0x1 << ETH_X_CFG_EVNT_MODE_Pos),
    ETH_TRANSMITTER_EVENT_MODE_XFIFO_HALF_FULL    = (uint32_t)(0x2 << ETH_X_CFG_EVNT_MODE_Pos),
    ETH_TRANSMITTER_EVENT_MODE_XFIFO_ALMOST_FULL  = (uint32_t)(0x3 << ETH_X_CFG_EVNT_MODE_Pos),
    ETH_TRANSMITTER_EVENT_MODE_XFIFO_FULL         = (uint32_t)(0x4 << ETH_X_CFG_EVNT_MODE_Pos),
    ETH_TRANSMITTER_EVENT_MODE_PAKET_SENT         = (uint32_t)(0x5 << ETH_X_CFG_EVNT_MODE_Pos),
    ETH_TRANSMITTER_EVENT_MODE_READ_WORD          = (uint32_t)(0x6 << ETH_X_CFG_EVNT_MODE_Pos),
    ETH_TRANSMITTER_EVENT_MODE_START_TRANSMIT     = (uint32_t)(0x7 << ETH_X_CFG_EVNT_MODE_Pos)
} ETH_TRANSMITTER_EVENT_MODE;

#define ETH_TRANSMITTER_EVENT_MODE_MASK      (uint32_t)(0x7 << ETH_X_CFG_EVNT_MODE_Pos)

#define IS_ETH_TRANSMITTER_EVENT_MODE(MODE)  ((MODE & (~ETH_TRANSMITTER_EVENT_MODE_MASK)) == 0)

/**
  * @brief ETHERNET Receiver Endain (little endian or big endian)
  */
typedef enum
{
    ETH_RECEIVER_BE_LITTLE_ENDIAN = (uint32_t)(0x0 << ETH_R_CFG_BE_Pos),
    ETH_RECEIVER_BE_BIG_ENDIAN    = (uint32_t)(0x1 << ETH_R_CFG_BE_Pos)
} ETH_RECEIVER_BE;

