ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/SPL/MDR32FxQI/inc/MDR32FxQI_eth.h
#define IS_ETH_RECEIVER_BE(BE)  ((BE == ETH_RECEIVER_BE_LITTLE_ENDIAN) | \
                                 (BE == ETH_RECEIVER_BE_BIG_ENDIAN))

/**
  * @brief ETHERNET Receiver bits order
  */
typedef enum
{
    ETH_RECEIVER_BITS_ORDER_LSB = (uint32_t)(0 << ETH_R_CFG_MSB1st_Pos),
    ETH_RECEIVER_BITS_ORDER_MSB = (uint32_t)(0 << ETH_R_CFG_MSB1st_Pos)
} ETH_RECEIVER_BITS_ORDER;

#define IS_ETH_RECEIVER_BITS_ORDER(ORDER)   ((ORDER == ETH_RECEIVER_BITS_ORDER_LSB ) || \
                                             (ORDER == ETH_RECEIVER_BITS_ORDER_MSB))

/**
  * @brief ETHERNET Receiver Event Mode
  */
typedef enum
{
    ETH_RECEIVER_EVENT_MODE_RFIFO_NOT_EMPTY        = (uint32_t)(0x0 << ETH_R_CFG_EVNT_MODE_Pos),
    ETH_RECEIVER_EVENT_MODE_RFIFO_NOT_ALMOST_EMPTY = (uint32_t)(0x1 << ETH_R_CFG_EVNT_MODE_Pos),
    ETH_RECEIVER_EVENT_MODE_RFIFO_HALF_EMPTY       = (uint32_t)(0x2 << ETH_R_CFG_EVNT_MODE_Pos),
    ETH_RECEIVER_EVENT_MODE_RFIFO_NOT_ALMOST_FULL  = (uint32_t)(0x3 << ETH_R_CFG_EVNT_MODE_Pos),
    ETH_RECEIVER_EVENT_MODE_RFIFO_NOT_FULL         = (uint32_t)(0x4 << ETH_R_CFG_EVNT_MODE_Pos),
    ETH_RECEIVER_EVENT_MODE_PACET_RECEIVED         = (uint32_t)(0x5 << ETH_R_CFG_EVNT_MODE_Pos),
    ETH_RECEIVER_EVENT_MODE_WORD_RECEIVED          = (uint32_t)(0x6 << ETH_R_CFG_EVNT_MODE_Pos),
    ETH_RECEIVER_EVENT_MODE_PACET_DROPED           = (uint32_t)(0x7 << ETH_R_CFG_EVNT_MODE_Pos)
} ETH_RECEIVER_EVENT_MODE;

#define ETH_RECEIVER_EVENT_MODE_MASK                        (uint32_t)(0x7 << ETH_R_CFG_EVNT_MODE_Pos)

#define IS_ETH_RECEIVER_EVENT_MODE(MODE)                    ((MODE & (~ETH_RECEIVER_EVENT_MODE_MASK)) == 0)

/**
  * @brief ETHERNET Interrupt defintions
  */
typedef enum
{
    ETH_MAC_IT_MII_RDY  = (uint32_t)(0x00008000),
    ETH_MAC_IT_MDIO_INT = (uint32_t)(0x00004000),
    ETH_MAC_IT_CRS_LOST = (uint32_t)(0x00001000),
    ETH_MAC_IT_LC       = (uint32_t)(0x00000800),
    ETH_MAC_IT_UNDF     = (uint32_t)(0x00000400),
    ETH_MAC_IT_XF_ERR   = (uint32_t)(0x00000200),
    ETH_MAC_IT_XF_OK    = (uint32_t)(0x00000100),
    ETH_MAC_IT_SF       = (uint32_t)(0x00000080),
    ETH_MAC_IT_LF       = (uint32_t)(0x00000040),
    ETH_MAC_IT_CF       = (uint32_t)(0x00000020),
    ETH_MAC_IT_CRC_ERR  = (uint32_t)(0x00000010),
    ETH_MAC_IT_SMB_ERR  = (uint32_t)(0x00000008),
    ETH_MAC_IT_OVF      = (uint32_t)(0x00000004),
    ETH_MAC_IT_MISSED_F = (uint32_t)(0x00000002),
    ETH_MAC_IT_RF_OK    = (uint32_t)(0x00000001)
} ETH_IT_Def;

#define IS_ETH_MAC_IT(IT) ((IT & 0xFFFF2000) == 0)

/**
  * @brief ETHERNET Flags
  */
typedef enum
{
    ETH_MAC_FLAG_R_EMPTY  = ((uint32_t)0x00000001),
    ETH_MAC_FLAG_R_AEMPTY = ((uint32_t)0x00000002),
    ETH_MAC_FLAG_R_HALF   = ((uint32_t)0x00000004),
    ETH_MAC_FLAG_R_AFULL  = ((uint32_t)0x00000008),
    ETH_MAC_FLAG_R_FULL   = ((uint32_t)0x00000010),
    ETH_MAC_FLAG_X_EMPTY  = ((uint32_t)0x00000100),
    ETH_MAC_FLAG_X_AEMPTY = ((uint32_t)0x00000200),
    ETH_MAC_FLAG_X_HALF   = ((uint32_t)0x00000400),
    ETH_MAC_FLAG_X_AFULL  = ((uint32_t)0x00000800),
    ETH_MAC_FLAG_X_FULL   = ((uint32_t)0x00001000)
} ETH_MAC_FLAGx;

#define IS_ETH_MAC_FLAG(FLAG)   (((FLAG & 0xFFFFE0E0) == 0) | \
                                (!(FLAG == 0)))

/**
  * @brief ETHERNET Clock Source
  */
typedef enum
{
    ETH_PHY_CLOCK_SOURCE_HSI      = (uint32_t)(0x00000000),
    ETH_PHY_CLOCK_SOURCE_HSE      = (uint32_t)(0x10000000),
    ETH_PHY_CLOCK_SOURCE_PLLCPU_0 = (uint32_t)(0x20000000),
    ETH_PHY_CLOCK_SOURCE_HSE2     = (uint32_t)(0x30000000)
} ETH_Clock_Source;

#define IS_ETH_CLOCK_SOURCE(CLOCK_SOURCE)   ((CLOCK_SOURCE == ETH_PHY_CLOCK_SOURCE_HSI)      | \
                                             (CLOCK_SOURCE == ETH_PHY_CLOCK_SOURCE_HSE)      | \
                                             (CLOCK_SOURCE == ETH_PHY_CLOCK_SOURCE_PLLCPU_0) | \
                                             (CLOCK_SOURCE == ETH_PHY_CLOCK_SOURCE_HSE2))

/**
  * @brief ETHERNET Clock BRG
  */
typedef enum
{
    ETH_HCLKdiv1   = ((uint32_t)0x00),
    ETH_HCLKdiv2   = ((uint32_t)0x01),
    ETH_HCLKdiv4   = ((uint32_t)0x02),
    ETH_HCLKdiv8   = ((uint32_t)0x03),
    ETH_HCLKdiv16  = ((uint32_t)0x04),
    ETH_HCLKdiv32  = ((uint32_t)0x05),
    ETH_HCLKdiv64  = ((uint32_t)0x06),
    ETH_HCLKdiv128 = ((uint32_t)0x07)
} ETH_Clock_BRG;

#define IS_ETH_CLOCK_BRG(BRG)   (((BRG) >= 0) && ((BRG) <= 7))

/**
  * @brief ETHERNET PHY Clock HCLKdiv
  */
typedef enum
{
    ETH_PHY_HCLKdiv1   = ((uint32_t)0x00 << RST_CLK_ETH_CLOCK_PHY_BRG_Pos),
    ETH_PHY_HCLKdiv2   = ((uint32_t)0x01 << RST_CLK_ETH_CLOCK_PHY_BRG_Pos),
    ETH_PHY_HCLKdiv4   = ((uint32_t)0x02 << RST_CLK_ETH_CLOCK_PHY_BRG_Pos),
    ETH_PHY_HCLKdiv8   = ((uint32_t)0x03 << RST_CLK_ETH_CLOCK_PHY_BRG_Pos),
    ETH_PHY_HCLKdiv16  = ((uint32_t)0x04 << RST_CLK_ETH_CLOCK_PHY_BRG_Pos),
    ETH_PHY_HCLKdiv32  = ((uint32_t)0x05 << RST_CLK_ETH_CLOCK_PHY_BRG_Pos),
    ETH_PHY_HCLKdiv64  = ((uint32_t)0x06 << RST_CLK_ETH_CLOCK_PHY_BRG_Pos),
    ETH_PHY_HCLKdiv128 = ((uint32_t)0x07 << RST_CLK_ETH_CLOCK_PHY_BRG_Pos)
} ETH_PHY_Clock_HCLKdiv;

#define IS_ETH_PHY_HCLKdiv(BRG)   (((~BRG) & 0x00070000) == 0)

/**
  * @brief ETHERNET Clock Number
  */
typedef enum
{
    ETH_CLK1 = ((uint32_t)0x01000000),
    ETH_CLK2 = ((uint32_t)0x40000000)
} ETH_Clock_Number;

#define IS_ETH_CLK(ETH_CLK) ((ETH_CLK == ETH_CLK1) || \
                             (ETH_CLK == ETH_CLK2))

/**--------------------------------------------------------------------------**/
/**
  * @brief            Description of common PHY registers
  */
/**--------------------------------------------------------------------------**/

/**
  * @brief ETHERNET PHY FLAGs
  */
typedef enum
{
    ETH_PHY_FLAG_MDINT         = ((uint32_t)0x00000400),
    ETH_PHY_FLAG_MDO           = ((uint32_t)0x00000200),
    ETH_PHY_FLAG_FX_VALID      = ((uint32_t)0x00000100),
    ETH_PHY_FLAG_COL           = ((uint32_t)0x000000C0),
    ETH_PHY_FLAG_CRS           = ((uint32_t)0x00000020),
    ETH_PHY_FLAG_READY         = ((uint32_t)0x00000010),
    ETH_PHY_FLAG_FULL_DUPLEX   = ((uint32_t)0x00000008),
    ETH_PHY_FLAG_CARRIER_SENSE = ((uint32_t)0x00000004),
    ETH_PHY_FLAG_LINK          = ((uint32_t)0x00000002),
    ETH_PHY_FLAG_100MBIT       = ((uint32_t)0x00000001)
} ETH_PHY_FLAGx;

#define IS_ETH_PHY_FLAG(FLAG)   ((FLAG == ETH_PHY_FLAG_MDINT)         || \
                                 (FLAG == ETH_PHY_FLAG_MDO)           || \
                                 (FLAG == ETH_PHY_FLAG_FX_VALID)      || \
                                 (FLAG == ETH_PHY_FLAG_COL)           || \
                                 (FLAG == ETH_PHY_FLAG_CRS)           || \
                                 (FLAG == ETH_PHY_FLAG_READY)         || \
                                 (FLAG == ETH_PHY_FLAG_FULL_DUPLEX)   || \
                                 (FLAG == ETH_PHY_FLAG_CARRIER_SENSE) || \
                                 (FLAG == ETH_PHY_FLAG_LINK)          || \
                                 (FLAG == ETH_PHY_FLAG_100MBIT))

/**
  * @brief ETHERNET PHY Register address
  */
typedef enum
{
    PHY_BCR      =  0,  /*!< Basic Control Register */
    PHY_BSR      =  1,  /*!< Basic Status Register */
    PHY_ID1      =  2,
    PHY_ID2      =  3,
    PHY_ATU      =  4,
    PHY_OPP_ATU  =  5,
    PHY_EATU     =  6,
    PHY_EMODE    = 18,
    PHY_IT_FLAGs = 29,
    PHY_IT_MASKs = 30,
    PHY_ECTR     = 31
} ETH_PHY_Reg_Addr;

