ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/SPL/MDR32FxQI/inc/MDR32FxQI_eth.h
#define IS_ETH_PHYReg(PHYreg)   (((PHYreg >= 0 ) && (PHYreg <= 6))  || \
                                  (PHYreg == 18) || (PHYreg == 29)  || \
                                  (PHYreg == 30) || (PHYreg == 31))

/**
  * @brief ETHERNET Init Structure definition
  * @note  The user should not configure all the ETH_InitTypeDef structure's fields.
  *        By calling the ETH_StructInit function the structure’s fields are set to their default values.
  *        Only the parameters that will be set to a non-default value should be configured.
  */
typedef struct
{
    /**
      * @brief PHY
      */
    uint32_t                   ETH_PHY_Address;                /*!< Addres PHY.
                                                                    This parameter can be a value from 0 to 0x1F. */
    ETH_PHY_MODE               ETH_PHY_Mode;                   /*!< Selects the PHY MODE.
                                                                    This parameter can be a value of @ref ETH_PHY_MODE. */
    ETH_PHY_INTERFACE          ETH_PHY_Interface;              /*!< Selects the PHY interface.
                                                                    This parameter can be a value of @ref ETH_PHY_INTERFACE. */
    /**
      * @brief MAC General Config
      */
    uint32_t                   ETH_Dilimiter;                  /*!< Defines the boundaries of the transmitter and receiver buffers.
                                                                    This parameter can be a value from 0 to 0x1FFF. */
    ETH_DBG_MODE               ETH_DBG_Mode;                   /*!< Select the mode of operation in debug mode.
                                                                    This parameter can be a value of @ref ETH_DBG_MODE. */
    FunctionalState            ETH_DBG_XF;                     /*!< Enable or disable automatic change of the transmitter FIFO pointers.
                                                                    This parameter can be a value of @ref FunctionalState. */
    FunctionalState            ETH_DBG_RF;                     /*!< Enable or disable automatic change of the receiver FIFO pointers.
                                                                    This parameter can be a value of @ref FunctionalState. */
    FunctionalState            ETH_Loopback_Mode;              /*!< Selects or not the internal MAC Loopback mode.
                                                                    This parameter can be: ENABLE or DISABLE. */
    BitStatus                  ETH_Receiver_RST;               /*!< Receiver reset bit.
                                                                    This parameter can be a value of @ref BitStatus. */
    BitStatus                  ETH_Transmitter_RST;            /*!< Transmitter reset bit.
                                                                    This parameter can be a value of @ref BitStatus. */
    FunctionalState            ETH_Register_CLR;               /*!< Permission or prohibition of discharge status registers his reading.
                                                                    This parameter can be: ENABLE or DISABLE. */
    ETH_BUFFER_MODE            ETH_Buffer_Mode;                /*!< Set the operating mode buffers.
                                                                    This parameter can be a value of @ref ETH_BUFFER_MODE */
    FunctionalState            ETH_Extension_Mode;             /*!< Enable or disable mode additions to the size of short packets slotTime field "Extension".
                                                                    This parameter can be: ENABLE or DISABLE. */
    FunctionalState            ETH_HalfDuplex_Mode;            /*!< Enable or disable half-duplex operation.
                                                                    This parameter can be: ENABLE or DISABLE. */
    FunctionalState            ETH_DTRM;                       /*!< Enable or disable mode deterministic delivery time.
                                                                    This parameter can be: ENABLE or DISABLE. */
    FunctionalState            ETH_Pause;                      /*!< Enable or disable the automatic packet processing PAUSE.
                                                                    This parameter can be: ENABLE or DISABLE. */
    uint32_t                   ETH_ColWnd;                     /*!< Set the size of the "window collisions".
                                                                    This parameter can be a value from 0 to 0xFF. */
    /**
     * @brief MAC Transmitter Config
     */
    FunctionalState            ETH_Transmitter_State;          /*!< The state of the transmitter.
                                                                    This parameter can be: ENABLE or DISABLE. */
    ETH_TRANSMITTER_BE         ETH_Transmitter_BE;             /*!< Set the sequence of bytes in the word transmitter.
                                                                    This parameter can be a value of @ref ETH_TRANSMITTER_BE. */
    ETH_TRANSMITTER_BITS_ORDER ETH_Transmitter_Bits_Order;     /*!< The order of the bits in the transmission of data bytes.
                                                                    This parameter can be a value of @ref ETH_TRANSMITTER_BITS_ORDER. */
    ETH_TRANSMITTER_EVENT_MODE ETH_Transmitter_Event_Mode;     /*!< Defines mode of operation withdrawal EVNT[1].
                                                                    This parameter can be a value of @ref ETH_TRANSMITTER_EVENT_MODE. */
    FunctionalState            ETH_Automatic_Pad_Strip;        /*!< Enable or disable addition to the minimum packet length PAD-s.
                                                                    This parameter can be: ENABLE or DISABLE. */
    FunctionalState            ETH_Automatic_Preamble;         /*!< Enable or disable supplement packet preamble.
                                                                    This parameter can be: ENABLE or DISABLE. */
    FunctionalState            ETH_Automatic_CRC_Strip;        /*!< Enable or disable supplement package automatically calculated CRC.
                                                                    This parameter can be: ENABLE or DISABLE. */
    FunctionalState            ETH_Automatic_IPG;              /*!< Enable or disable curing system pauses between sending packets.
                                                                    This parameter can be: ENABLE or DISABLE. */
    uint32_t                   ETH_Retry_Counter;              /*!< Maximum number of attempts to send a packet.
                                                                    This parameter can be a value from 0 to 0xF. */
    /**
     * @brief MAC Receiver Config
     */
    FunctionalState            ETH_Receiver_State;             /*!< The state of the receiver.
                                                                    This parameter can be a value of @ref FunctionalState. */
    ETH_RECEIVER_BE            ETH_Receiver_BE;                /*!< Set the sequence of bytes in the word receiver.
                                                                    This parameter can be a value of @ref ETH_RECEIVER_BE. */
    ETH_RECEIVER_BITS_ORDER    ETH_Receiver_Bits_Order;        /*!< Set the sequence of bits at the reception of data bytes.
                                                                    This parameter can be a value of @ref ETH_RECEIVER_BITS_ORDER. */
    ETH_RECEIVER_EVENT_MODE    ETH_Receiver_Event_Mode;        /*!< Defines mode of operation withdrawal EVNT[0].
                                                                    This parameter can be a value of @ref ETH_RECEIVER_EVENT_MODE. */
    FunctionalState            ETH_Receive_All_Packets;        /*!< Selects or not all frames reception by the MAC (No filtering).
                                                                    This parameter can be a value of @ref FunctionalState. */
    FunctionalState            ETH_Short_Frames_Reception;     /*!< Enable or disable the reception of packets of less than the minimum.
                                                                    This parameter can be a value of @ref FunctionalState. */
    FunctionalState            ETH_Long_Frames_Reception;      /*!< Enable or disable the reception of packets longer than the maximum.
                                                                    This parameter can be a value of @ref FunctionalState. */
    FunctionalState            ETH_Broadcast_Frames_Reception; /*!< Enable or disable Receiving packet broadcast MAC-address.
                                                                    This parameter can be a value of @ref FunctionalState. */
    FunctionalState            ETH_Error_CRC_Frames_Reception; /*!< Enable or disable receiving packets with errors.
                                                                    This parameter can be a value of @ref FunctionalState. */
    FunctionalState            ETH_Control_Frames_Reception;   /*!< Enable or disable receiving control packets.
                                                                    This parameter can be a value of @ref FunctionalState. */
    FunctionalState            ETH_Unicast_Frames_Reception;   /*!< Enable or disable receiving packets with MAC-address specified in the register MAC_Address.
                                                                    This parameter can be a value of @ref FunctionalState. */
    FunctionalState            ETH_Source_Addr_HASH_Filter;    /*!< Enable or disable receiving packets with a multicast MAC-address-filtered HAS-table.
                                                                    This parameter can be a value of @ref FunctionalState. */
    /**
     * @brief MAC Address
     */
    uint16_t                   ETH_MAC_Address[3];                    /*!< Individual MAC address */
    /**
     * @brief Hash Table
     */
    uint32_t                   ETH_Hash_Table_High;                 /*!< This field holds the higher 32 bits of Hash table.  */
    uint32_t                   ETH_Hash_Table_Low;                  /*!< This field holds the lower 32 bits of Hash table.  */
    /**
     * @brief Time settings
     */
    uint32_t                   ETH_IPG;                            /*!< The value of inter-packet interval for full duplex
                                                                       This parameter can be a value from 0 to 0xFFFF. */
    uint32_t                   ETH_PSC;                            /*!< Prescaler value increment values for BAG and JitterWnd.
                                                                       This parameter can be a value from 0 to 0xFFFF. */
    uint32_t                   ETH_BAG;                            /*!< The period value of the packets.
                                                                       This parameter can be a value from 0 to 0xFFFF. */
    uint32_t                   ETH_JitterWnd;                        /*!< Jitter value of packets transmitted.
                                                                       This parameter can be a value from 0 to 0xFFFF. */
} ETH_InitTypeDef;

/**
 * @brief Bit-field structure of the state of the packet reception
 */
typedef struct
{
    uint32_t Length  :16; /*!< The number of bytes in the packet including header and CRC. */
    uint32_t PF_ERR  :1;  /*!< A sign package PAUSE. */
    uint32_t CF_ERR  :1;  /*!< A sign Management Pack (filtering by MAC and special tags in the field length - 13.14 - octets). */
    uint32_t LF_ERR  :1;  /*!< A sign excess packet length 1518 octets. */
    uint32_t SF_ERR  :1;  /*!< A sign of lack of packet length 64 octets. */
    uint32_t LEN_ERR :1;  /*!< A sign mismatch between the actual length and the length specified in the length field - 13.14 octets. */
    uint32_t DN_ERR  :1;  /*!< A sign bit of the packet is not a multiple of 8. */
    uint32_t CRC_ERR :1;  /*!< A sign mismatch packet CRC. */
    uint32_t SMB_ERR :1;  /*!< A sign of the presence in the packet error nibbles. */
    uint32_t MCA     :1;  /*!< A sign group package (MAC matches HASH). */
    uint32_t BCA     :1;  /*!< A sign of the broadcast packet (MAC = FF:FF:FF:FF:FF:FF). */
    uint32_t UCA     :1;  /*!< A sign individual package (MAC corresponds to the set). */
} ETH_StatusPacketReceptionBitFileds;

/**
 * @brief The state of the packet reception    Unioun definition
 */
typedef union
{
    uint32_t Status;                           /*!< Specifies the fully status Word. */
    ETH_StatusPacketReceptionBitFileds Fields; /*!< Specifies the particular field of the status word.*/
} ETH_StatusPacketReceptionTypeDef;

/** @} */ /* End of group ETH_Exported_Types */


/** @defgroup ETH_Exported_Constants ETHERNET Exported Constants
  * @{
  */

/** @defgroup PHY_Read_Write_Timeouts PHY Read write Timeouts
  * @{
  */

#define PHY_READ_TO             ((uint32_t)0x0004FFFF)
#define PHY_WRITE_TO            ((uint32_t)0x0004FFFF)

/** @} */ /* End of group PHY_Read_Write_Timeouts */

/** @} */ /* End of group ETH_Exported_Constants */


/** @defgroup ETH_Exported_Functions ETHERNET Exported Functions
 *     @{
 */

void ETH_ClockDeInit(void);
void ETH_PHY_ClockConfig(ETH_Clock_Source clock_source, ETH_PHY_Clock_HCLKdiv PHY_HCLKdiv);
void ETH_BRGInit(ETH_Clock_BRG ETH_HCLKdiv);
void ETH_ClockCMD(ETH_Clock_Number ETHx, FunctionalState NewState);
void ETH_PHY_Reset(MDR_ETHERNET_TypeDef * ETHERNETx);
void ETH_PHYCmd(MDR_ETHERNET_TypeDef * ETHERNETx, FunctionalState NewState);
void ETH_DeInit(MDR_ETHERNET_TypeDef * ETHERNETx);
void ETH_StructInit(ETH_InitTypeDef * ETH_InitStruct);
void ETH_Init(MDR_ETHERNET_TypeDef * ETHERNETx, ETH_InitTypeDef * ETH_InitStruct);
void ETH_Start(MDR_ETHERNET_TypeDef * ETHERNETx);
void ETH_MACTransmissionCmd(MDR_ETHERNET_TypeDef * ETHERNETx, FunctionalState NewState);
void ETH_MACReceptionCmd(MDR_ETHERNET_TypeDef * ETHERNETx, FunctionalState NewState);
uint16_t ETH_GetMACITStatusRegister(MDR_ETHERNET_TypeDef * ETHERNETx);
FlagStatus ETH_GetMACITStatus(MDR_ETHERNET_TypeDef * ETHERNETx, uint32_t ETH_MAC_FLAG);
uint32_t ETH_GetMACStatusRegister(MDR_ETHERNET_TypeDef * ETHERNETx);
void ETH_MACITConfig(MDR_ETHERNET_TypeDef * ETHERNETx, uint32_t ETH_MAC_IT, FunctionalState NewState);
void ETH_MACAddressConfig(MDR_ETHERNET_TypeDef * ETHERNETx, uint16_t *MacAddr);
void ETH_GetMACAddress(MDR_ETHERNET_TypeDef * ETHERNETx, uint16_t *Addr);
FlagStatus ETH_GetPHYStatus(MDR_ETHERNET_TypeDef * ETHERNETx, uint16_t ETH_PHY_FLAG);
uint16_t ETH_ReadPHYRegister(MDR_ETHERNET_TypeDef * ETHERNETx, uint16_t PHYAddress, ETH_PHY_Reg_Addr PHYReg);
ErrorStatus ETH_WritePHYRegister(MDR_ETHERNET_TypeDef * ETHERNETx, uint16_t PHYAddress, ETH_PHY_Reg_Addr PHYReg, uint16_t PHYValue);
uint32_t ETH_ReceivedFrame(MDR_ETHERNET_TypeDef * ETHERNETx, uint32_t * ptr_InputBuffer);
void ETH_SendFrame(MDR_ETHERNET_TypeDef * ETHERNETx, uint32_t * ptr_OututBuffer, uint32_t BufLen);
void ETH_DMAPrepare(void);
void ETH_DMAFrameRx(uint32_t * DstBuf, uint32_t BufferSize, uint32_t * SrcBuf);
void ETH_DMAFrameTx(uint32_t * DstBuf, uint32_t BufferSize, uint32_t *  SrcBuf);

FlagStatus ETH_GetFlagStatus(MDR_ETHERNET_TypeDef * ETHERNETx, uint16_t ETH_MAC_FLAG);

/** @} */ /* End of group ETH_Exported_Functions */

#endif /* #if defined (USE_MDR32F1QI) */

/** @} */ /* End of group ETHERNET */

/** @} */ /* End of group __MDR32FxQI_StdPeriph_Driver */

#ifdef __cplusplus
} // extern "C" block end
#endif

#endif /* __MDR32FxQI_ETH_H */

/*********************** (C) COPYRIGHT 2022 Milandr ****************************
*
* END OF FILE MDR32FxQI_eth.h */


